native-web-gateway/src/test/resources/xml/goodbye-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sample="urn:samples-switchyard:bean:1.0">
    <soapenv:Header />
    <soapenv:Body>
        <sample:goodbye>
            <sample:string>Test</sample:string>
        </sample:goodbye>
    </soapenv:Body>
</soapenv:Envelope>
